app/views/albums/edit.html.erb


    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"