app/views/albums/show.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
<h1> <%= Band.find_by(id: @album.band_id).name %>><%= @album.title %> </h1>