app/controllers/albums_controller.rb

    def create
      @album = Album.new(album_params)

      if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 8], ["title", "A Live One"], ["year", 1998], ["created_at", "2018-09-13 23:30:04.433828"], ["updated_at", "2018-09-13 23:30:04.433828"]]

    def show
      @album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def edit
      @album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]