app/controllers/bands_controller.rb

  def edit
    @band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def show
    @band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @band = Band.find_by(id: params[:id])

    if @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Jimmayyyy Hendrix"], ["updated_at", "2018-09-14 00:09:49.951840"], ["id", 6]]

  def destroy
    @band = Band.find_by(id: params[:id])
    @band.delete
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]