app/controllers/users_controller.rb

  def show #look at the wildcard id and find the user by that, then render their page... @user gets passed to the view page
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]