app/models/user.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "brett@email.com"], ["password_digest", "$2a$10$CSvzGNtBLum4ZQ5tx0UvCevFGwUvvknrcFjMUrxUUNJZDUg.I.xOC"], ["session_token", "oXMvF6wg67Udgvdw5jF_Pg"]]
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "T--uthVuF7XedhcH3XsM1Q"], ["updated_at", "2018-09-13 21:16:15.248575"], ["id", 2]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!